app/views/scrapes/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."scrape_id" = ?  [["scrape_id", 1]]
---
	</tr>
<% @scrape.books.each do |book| %>