app/views/words/show.html.erb

<h2>Sections:</h2>
<% @word.sections.each do |s| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."word_id" = ?  [["word_id", 2]]