app/controllers/pages_controller.rb

  def index
	@pages = Page.all
	@words = Word.all
	@products = Product.all
---
SELECT "pages".* FROM "pages"
SELECT "words".* FROM "words"
SELECT "products".* FROM "products"

  def show
    @page = Page.find(params[:id])
	@words = Word.all
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "words".* FROM "words"

  def create
    @page = Page.new(page_params)

    if @page.save
---
INSERT INTO "pages" ("title", "bgColor", "fontColor", "fontStyle", "borderStyle", "borderWidth", "borderColor", "aLink", "aVisited", "aHover", "aActive", "titleUnderline", "titleItalicize", "defaultLinks", "titlePosition", "bgImageBool", "bgImage", "bgImageTile", "bgImageScroll", "borderRounded", "textStyle", "textShadow", "shadowBlur", "shadowColor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @page = Page.find(params[:id])

    if @page.update(page_params)
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pages" SET "fontStyle" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["fontStyle", "Monospace"], ["updated_at", "2022-11-06 05:21:25.255017"], ["id", 2]]

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 2]]