app/controllers/products_controller.rb

SELECT "words".* FROM "words"
SELECT "pages".* FROM "pages"
---
  def new
    @product = Product.new
	@words = Word.all
	@pages = Page.all

SELECT "words".* FROM "words"
SELECT "pages".* FROM "pages"
INSERT INTO "products" ("title", "htmlID", "cssID", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdfasdf"], ["htmlID", 1], ["cssID", 1], ["created_at", "2022-11-16 04:07:10.510167"], ["updated_at", "2022-11-16 04:07:10.510167"]]
---
  def create
    @product = Product.new(product_params)
	@words = Word.all
	@pages = Page.all

    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "words".* FROM "words"
SELECT "pages".* FROM "pages"
---
  def edit
    @product = Product.find(params[:id])
	@words = Word.all
	@pages = Page.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def export
    @product = Product.find(params[:id])