app/controllers/responses_controller.rb

  def index
    @responses = Response.all
---
SELECT "responses".* FROM "responses"

  def show
    @response = Response.find(params[:id])
---
SELECT "responses".* FROM "responses" WHERE "responses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @response = Response.new(response_params)

    if @response.save
---
INSERT INTO "responses" ("q1", "q2", "q3", "q4", "q5", "q6", "q7", "q8", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["q1", 3], ["q2", 3], ["q3", 3], ["q4", 3], ["q5", "1"], ["q6", "1"], ["q7", "1"], ["q8", "1"], ["created_at", "2022-11-28 21:35:21.917556"], ["updated_at", "2022-11-28 21:35:21.917556"]]

  def export
    @response = Response.find(params[:id])
---
SELECT "responses".* FROM "responses" WHERE "responses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]