app/controllers/scrapes_controller.rb

SELECT "scrapes".* FROM "scrapes"
---
  def index
	  @scrapes = Scrape.all

SELECT "scrapes".* FROM "scrapes" WHERE "scrapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @scrape = Scrape.find(params[:id])

SELECT "scrapes".* FROM "scrapes" WHERE "scrapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @scrape = Scrape.find(params[:id])

SELECT "scrapes".* FROM "scrapes" WHERE "scrapes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."scrape_id" = ?  [["scrape_id", 1]]
---
  def export
    @scrape = Scrape.find(params[:id])
  page_url = "http://localhost:3000/scrapes/" + params[:id].to_s
  response = HTTParty.get(page_url)
    @csvname = @scrape.title + ".csv"
  puts "\n\nExporting...\n\n"

  File.open("Exports/BookScrapes/" + @scrape.title + ".csv", "w") {
    |file|
    file.write("TITLE, PRICE, AVAILABILITY \n")
    @scrape.books.each do |book|