app/controllers/sections_controller.rb

  def create
    @word = Word.find(params[:word_id])
    @section = @word.sections.create(section_params)
---
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sections" ("title", "tag", "body", "word_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdfasdfasdfasdf"], ["tag", "p"], ["body", "asdfasdfasdf"], ["word_id", 1], ["created_at", "2022-11-16 04:06:43.178097"], ["updated_at", "2022-11-16 04:06:43.178097"]]