app/controllers/words_controller.rb

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
	@word = Word.find(params[:id])

INSERT INTO "words" ("image", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", nil], ["title", "asdf"], ["created_at", "2022-11-16 04:06:27.452941"], ["updated_at", "2022-11-16 04:06:27.452941"]]
---
  def create
    @word = Word.new(word_params)

    if @word.save

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
    @word = Word.find(params[:id])

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "words" SET "updated_at" = ? WHERE "words"."id" = ?  [["updated_at", "2022-11-12 19:12:21.723903"], ["id", 1]]
---
  def update
    @word = Word.find(params[:id])

    if @word.update(word_params)