app/views/products/show.html.erb

<% @wordModel = Word.find(@product.htmlID) %>
<% @pageModel = Page.find(@product.cssID) %>
---
SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]